#### Terraform Format and Style 🖌`failure`
#### staging - Terraform Initialization ⚙️`success`
#### staging - Terraform Validation 🤖Success! The configuration is valid.


#### staging - Terraform Plan 📖`success`

<details><summary>staging - Show Plan</summary>

```terraform
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-staging/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-staging/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-staging/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[16]: Refreshing state... [id=terra-datarepo-staging/cloudkms.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-staging/logging.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-staging/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-staging/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-staging/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-staging/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-staging/dns.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-staging/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-staging/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-staging/compute.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-staging/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-staging/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-staging/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-staging/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-staging/container.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-staging/sql-component.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-staging/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-staging/global/networks/staging-network]
module.core-infrastructure.google_service_account.node_pool: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_key_ring.db: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/keyRings/jade-db]
module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access: Refreshing state... [id=terra-datarepo-staging/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-staging/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_project_iam_member.node_pool[3]: Refreshing state... [id=terra-datarepo-staging/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[1]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.metricWriter/serviceaccount:gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[0]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.viewer/serviceaccount:gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[2]: Refreshing state... [id=terra-datarepo-staging/roles/logging.logWriter/serviceaccount:gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_crypto_key.db: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/keyRings/jade-db/cryptoKeys/jade]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/subnetworks/staging-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-staging/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/jade-staging-ip]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=e4_Gm8FYOX0obHjHwLHlCA]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.module.sql_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=Q0c_L6KXhSQ]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=qyJhMAwOBt5d1-lvgRv9GA]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=KPftzftWN3wzfpr-sscW4Q]
module.datarepo-app.module.sql_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.sql_workloadid.google_project_iam_member.service-account-role["roles/cloudsql.client"]: Refreshing state... [id=terra-datarepo-staging/roles/cloudsql.client/serviceaccount:datarepo-jade-sqlproxy@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[7]: Refreshing state... [id=folders/753276429356/roles/resourcemanager.projectMover/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[9]: Refreshing state... [id=folders/753276429356/roles/owner/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[2]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[5]: Refreshing state... [id=folders/753276429356/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[3]: Refreshing state... [id=folders/753276429356/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[1]: Refreshing state... [id=folders/753276429356/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[10]: Refreshing state... [id=folders/270278425081/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[6]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.projectMover/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[0]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[11]: Refreshing state... [id=folders/753276429356/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[4]: Refreshing state... [id=folders/270278425081/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[8]: Refreshing state... [id=folders/270278425081/roles/owner/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com/keys/9e3958203a25bd4cb03fea74b66428505693dcc3]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-staging/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-staging/roles/cloudsql.editor/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-staging/roles/pubsub.editor/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-staging/roles/viewer/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-staging/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-staging/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-staging/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-staging/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-staging/roles/cloudprofiler.agent/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-staging/roles/cloudtrace.agent/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-staging/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-staging/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com/keys/0887caee2ddf39743deb11b52b0ff2612be81c09]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-staging/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-staging/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-staging/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-staging%2Fglobal%2Fnetworks%2Fstaging-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/staging/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/staging/test-runner-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-staging/instances/datarepo-db-jade-43473f2fa2978524/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-staging/instances/datarepo-db-jade-43473f2fa2978524/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/staging/datarepo-sql-db]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-staging/uptimeCheckConfigs/data-staging-envs-terra-bio]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-staging/notificationChannels/18199841202267095917]
module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-staging/notificationChannels/7240771105998751303]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/8989025042201786625]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/16184180379069024206]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/16776997133258105231]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/9790853949548877150]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.core-infrastructure.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      ~ billing_account     = "01A74A-A76CA5-3F7A41" -> (known after apply)
      ~ folder_id           = "515848343888" -> (known after apply)
      ~ id                  = "projects/terra-datarepo-staging" -> (known after apply)
      ~ labels              = {
          - "billing"    = "01a74a-a76ca5-3f7a41"
          - "costobject" = "broad-8201553"
        } -> (known after apply)
      ~ name                = "terra-datarepo-staging" -> (known after apply)
      ~ number              = "762196585894" -> (known after apply)
      + org_id              = (known after apply)
      - project_id          = "terra-datarepo-staging" -> null
      + skip_delete         = (known after apply)
    }

  # module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access will be updated in-place
  ~ resource "google_project_iam_binding" "kubernetes_engine_kms_access" {
        id      = "terra-datarepo-staging/roles/cloudkms.cryptoKeyEncrypterDecrypter"
      ~ members = [
          - "serviceAccount:service-762196585894@container-engine-robot.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.core-infrastructure.google_project_iam_member.node_pool[3] will be created
  + resource "google_project_iam_member" "node_pool" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gke-node-sa@terra-datarepo-staging.iam.gserviceaccount.com"
      + project = "terra-datarepo-staging"
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC5559" -> (known after apply)
      - version          = -1 -> null
        # (1 unchanged attribute hidden)
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        id           = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
        name         = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "workbench_notification_channel" {
        id           = "projects/terra-datarepo-staging/notificationChannels/7240771105998751303"
        name         = "projects/terra-datarepo-staging/notificationChannels/7240771105998751303"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-app.vault_generic_secret.test_runner_sa_key[0] will be updated in-place
  ~ resource "vault_generic_secret" "test_runner_sa_key" {
      ~ data_json    = (sensitive value)
        id           = "secret/dsde/datarepo/staging/test-runner-sa"
        # (3 unchanged attributes hidden)
    }

  # module.enable-services.google_project_service.required-services[17] will be created
  + resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terra-datarepo-staging"
      + service            = "appengine.googleapis.com"
    }

  # module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0] will be updated in-place
  ~ resource "google_container_node_pool" "pool" {
        id                  = "projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem"
        name                = "jade-node-us-central-1-cis-highmem"
        # (9 unchanged attributes hidden)


      ~ node_config {
          ~ image_type        = "COS_CONTAINERD" -> "COS"
            tags              = [
                "terra-datarepo-staging",
                "jade",
                "kubernetes",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "cluster_versions"  {
      ~ default_cluster_version         = "1.24.7-gke.900" -> (known after apply)
      ~ id                              = "2023-01-20 17:44:58.258796546 +0000 UTC" -> (known after apply)
      + latest_master_version           = (known after apply)
      ~ latest_node_version             = "1.17.14-gke.400" -> (known after apply)
      ~ release_channel_default_version = {
          - "RAPID"   = "1.25.4-gke.2100"
          - "REGULAR" = "1.24.7-gke.900"
          - "STABLE"  = "1.23.13-gke.900"
        } -> (known after apply)
      ~ valid_master_versions           = [] -> (known after apply)
      ~ valid_node_versions             = [
          - "1.17.14-gke.400",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1"
      + min_master_version          = (known after apply)
        name                        = "jade-master-us-central1"
        # (26 unchanged attributes hidden)















        # (15 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts will be updated in-place
  ~ resource "google_monitoring_alert_policy" "node_resource_alerts" {
        id                    = "projects/terra-datarepo-staging/alertPolicies/16184180379069024206"
        name                  = "projects/terra-datarepo-staging/alertPolicies/16184180379069024206"
      ~ notification_channels = [
          - "projects/terra-datarepo-staging/notificationChannels/11305744488928405501",
          + "projects/terra-datarepo-staging/notificationChannels/18199841202267095917",
          + "projects/terra-datarepo-staging/notificationChannels/7240771105998751303",
        ]
        # (6 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "pod_health_alert" {
        id                    = "projects/terra-datarepo-staging/alertPolicies/8989025042201786625"
        name                  = "projects/terra-datarepo-staging/alertPolicies/8989025042201786625"
      ~ notification_channels = [
          - "projects/terra-datarepo-staging/notificationChannels/11305744488928405501",
          + "projects/terra-datarepo-staging/notificationChannels/18199841202267095917",
          + "projects/terra-datarepo-staging/notificationChannels/7240771105998751303",
        ]
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util will be updated in-place
  ~ resource "google_monitoring_alert_policy" "pod_memory_util" {
        id                    = "projects/terra-datarepo-staging/alertPolicies/16776997133258105231"
        name                  = "projects/terra-datarepo-staging/alertPolicies/16776997133258105231"
      ~ notification_channels = [
          - "projects/terra-datarepo-staging/notificationChannels/11305744488928405501",
          + "projects/terra-datarepo-staging/notificationChannels/18199841202267095917",
          + "projects/terra-datarepo-staging/notificationChannels/7240771105998751303",
        ]
        # (6 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0] will be updated in-place
  ~ resource "google_monitoring_alert_policy" "uptime-check" {
        id                    = "projects/terra-datarepo-staging/alertPolicies/9790853949548877150"
        name                  = "projects/terra-datarepo-staging/alertPolicies/9790853949548877150"
      ~ notification_channels = [
          - "projects/terra-datarepo-staging/notificationChannels/11305744488928405501",
          + "projects/terra-datarepo-staging/notificationChannels/18199841202267095917",
          + "projects/terra-datarepo-staging/notificationChannels/7240771105998751303",
        ]
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 10 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @snf2ye, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*